[
    {
        "video_id": "gKjlzy7nhqY",
        "video_title": "The Best Snapdragon X Elite & Plus Laptops",
        "comments": [
            {
                "author_name": "@JustJoshTech",
                "comment": "Our Favorites Snapdragon Laptops 👇\r\n \r\n👉 Surface Laptop 7 13: https://howl.me/cmIYMj29aDV\r\n🎉 Yoga Slim 7x: https://howl.me/cmIYEKSAWO2\r\n🛒 Surface Laptop 7 15: https://howl.me/cmIYO1EgFzG\r\n💻 Vivobook S 15 X Elite: https://amzn.to/4bRRUkR\r\n🏅Samsung Galaxy Book 4 Edge 16: https://howl.me/cmrSZrjdRR8\r\n\r\n👉 All Our Recommended Laptops: https://www.justjosh.tech/best-tech/",
                "likes": 7
            },
            {
                "author_name": "@yourmommashouse",
                "comment": "When showing charts and graphs it would be helpful if you could differentiate the highest and lowest from the rest of the bunch. Maybe highest is green and the lowest is red… while you color the rest as usual.",
                "likes": 0
            },
            {
                "author_name": "@innosanto",
                "comment": "Vivobook has the jight colour buttons which has been said so many times as a bug negative of HP. You are contradicting.",
                "likes": 0
            },
            {
                "author_name": "@Paprika526",
                "comment": "Love Cierra and your channel, but I'm very sensitive to vocal fry, it's like nails over a blackboard for me 😢 still, watched the entire video since the content is so good.",
                "likes": 0
            },
            {
                "author_name": "@MrPaukann",
                "comment": "You said the speaker test is from worst to best. Are you seriously suggesting that inspiron's speakers are better than XPS'?",
                "likes": 0
            },
            {
                "author_name": "@evaeva8731",
                "comment": "Why do you speak like that ? \nIt's really really annoying \nPlease im begging you the echo of your voice is so giving me headaches",
                "likes": 0
            },
            {
                "author_name": "@arainla",
                "comment": "Bought the Lenovo slim 7x and very happy with it. Battery life has been great but I always fail to believe it and end up charging as I worry I will be without a charge. But it goes through the whole day for me. Only con for me is it’s a bit of a fingerprint magnet otherwise it’s thin, lightweight and performs really well for my Office apps and web based applications.",
                "likes": 0
            },
            {
                "author_name": "@LeicaM11",
                "comment": "Hope for 4nm Intel Lunar Lake PCs with over 100Tops Neural power in whole package and SoC shared RAM",
                "likes": 0
            },
            {
                "author_name": "@travel7217",
                "comment": "How about the battery life of Vivobook s 15 with snapdragon x plus \nit's more good than x elite or the same ?❤",
                "likes": 0
            },
            {
                "author_name": "@NautPanda",
                "comment": "What's your opinion on the Thinkpad T14 Gen 6 with the snapdragon chip?",
                "likes": 0
            },
            {
                "author_name": "@giacomo11",
                "comment": "Ryzen AI?? Can't wait",
                "likes": 0
            },
            {
                "author_name": "@ramanathan7823",
                "comment": "Blunt honest. No bullshit. To the point. Amazing amazing amazing great review. Actually the only honest review I see. My 10 years old also loves Josh and the girl. Simple English. ❤",
                "likes": 0
            },
            {
                "author_name": "@nft5646",
                "comment": "how much can wait for  Snapdragon Xelite (80-100) 2in1 laptops",
                "likes": 1
            },
            {
                "author_name": "@hakksim",
                "comment": "Thanks for another great and insightful video! I still don't quite understand the practical implications of poor gpu performance (except for gaming). I'm considering the 15\" Surface for work usage. It's mostly web apps on Chrome and Figma desktop app. But: I might have 50 Chrome tabs open at the same time running things like Google Sheets, Google Slides, Google Analytics, Miro etc. My current XPS13 from 2021 can get very sluggish with Chrome using 90% of gpu there. Would I have the same issue with these Snapdragon laptops? Considering that their performance is better but gpu underwhelming.. 🤔",
                "likes": 0
            },
            {
                "author_name": "@roaldflem426",
                "comment": "Will the Lenovo be good for having a lot of tabs open at once, having my notion database open, and writing on a couple of Word documents? (All at once)",
                "likes": 0
            },
            {
                "author_name": "@becontentandsilencethemind1562",
                "comment": "I would buy the amd over xelite any day….simply because of software compatibility…",
                "likes": 0
            },
            {
                "author_name": "@bemacbe",
                "comment": "I bought a MacBook Pro M1 Max in March from Amazon refurbished for $1700 and am very very happy with it! 😃 This should hold me over until the M4 Max comes out.",
                "likes": 0
            },
            {
                "author_name": "@hernublatt1977",
                "comment": "Does anyone know what happened with the Acer Swift 14 AI? It's still showing on their website, but it was never officially released... Weird...",
                "likes": 0
            },
            {
                "author_name": "@HoeExotic-vb3vc",
                "comment": "love that your brought the wife or girlfriend on the video. shes like you but doesn't have beautiful voice that you have, W combo tho.",
                "likes": 0
            },
            {
                "author_name": "@Dee-Ell",
                "comment": "Amazingly professional evaluation!  This puts those shill channels with millions of subs to shame.  Keep up the good work!",
                "likes": 0
            },
            {
                "author_name": "@kimonew",
                "comment": "hey can you review hp zbook G11 workstation? it's pretty expensive so i want to take some investigation but there are no reviews literally",
                "likes": 0
            },
            {
                "author_name": "@Ninja_Samurai-dd3kq",
                "comment": "All are bad than macbook, expensive, poor port selections",
                "likes": 0
            },
            {
                "author_name": "@wgm247",
                "comment": "Which laptop runs the most cool and quiet that has a 16\" screen ideal for web developers?",
                "likes": 0
            },
            {
                "author_name": "@fakuridesne",
                "comment": "Oh no. I just bought dell xps.😢",
                "likes": 0
            },
            {
                "author_name": "@horseman1956",
                "comment": "Samsung really dropped the ball when they failed to introduce their Snapdragon line without 2-in-1 capability.  The Samsung Notes application is a brilliant bit of work and adds a lot of value to the Samsung brand.  Without 2-in-1 capability, the Samsung Notes app for handwriting is useless on their laptops.  It isn't as though Samsung would have to reinvent new tech.  They already had the chassis, hinge and software.  All they had to do was deliver the 2-in-1 competitive edge that would have made their Snapdragon offering a must have, particularly for those already invested in the Samsung ecosystem.    As it stands, I skipped the Samsung offering and went with the 13\" Microsoft Surface laptop.   Great device and would be even better if I could use Microsoft Journal.  Sadly, while the Microsoft laptop is a very high quality device, it suffers the same handwriting limitation as all of the other Snapdragon devices.",
                "likes": 1
            },
            {
                "author_name": "@lincolnliking",
                "comment": "Great video Josh. A+ 👍🏾",
                "likes": 0
            },
            {
                "author_name": "@lincolnliking",
                "comment": "Been waiting for this",
                "likes": 0
            },
            {
                "author_name": "@norcalandrew",
                "comment": "I literally am about to return the Asus Vivo book you guys recommended. It's the worst laptop I've ever owned in my entire life 😂",
                "likes": 0
            },
            {
                "author_name": "@MikeVK4DX",
                "comment": "I wish you included Acer Swift 14.5 AI.",
                "likes": 1
            },
            {
                "author_name": "@TheEditorify",
                "comment": "\"You guys get the pitcher\" with an Aussie accent LMFAO",
                "likes": 0
            },
            {
                "author_name": "@agoogleuser7147",
                "comment": "I had lots of glitches with my surface laptop 7. \nSetup: Two 23\" 1080p/60hz monitors connected by surface dock 2. \n-Often found computer under full load when in sleep mode (fans running full speed and computer very warm to touch).\n-Resuming from sleep had changed resolution to one monitor often, and unplugging plugging back in sometimes worked.\n-Microsoft native ARM apps struggled to open/work at all.  Looking at you Teams (ARM) app.\n\nCan anyone else confirm if they have had these experiences? I experienced these issues for 5 weeks.\nI'm mainly interested in while machine is connected to external displays, as I don't see many people comment on this.",
                "likes": 0
            },
            {
                "author_name": "@kjelle2802",
                "comment": "Hey Josh. I am going to start studying computer science this summer, and for that i need a computer. I cant afford the New Zenbook S 16, but i can afford the New Vivobook S 16 with Ryzen 9 AI 365 with 32 gb of ram. It costs 1600 dollars here in Danmark. I will be using it to run virtual machines, networking and so on. Would you recommend that i buy it?",
                "likes": 0
            },
            {
                "author_name": "@RemofRenaissance",
                "comment": "I haven’t watched this yet, but just to say thank you as I like the snapdragon platform for my needs (ton of office work and reporting analysis).  That being said I already have one so this will be a review of my decision!",
                "likes": 0
            },
            {
                "author_name": "@luigibru8677",
                "comment": "Snapdragon is not ready yet",
                "likes": 0
            },
            {
                "author_name": "@ihatemondays8925",
                "comment": "Josh, during the day I suck up the information you put out and during the night, I am listening to your soothing voice to fall asleep! You are a staple in my household",
                "likes": 0
            },
            {
                "author_name": "@igorsim8170",
                "comment": "Hi guys. Thanks for great videaos. Looking to get Lenovo 9i for music production. Seems like one of the best non Apple option.  Thumbs up appreciated if you agree. Thanks.",
                "likes": 0
            },
            {
                "author_name": "@chrism1051",
                "comment": "@Josh. Since you're using the surface laptop as daily driver, what's the average battery life you get doing regular work?",
                "likes": 0
            },
            {
                "author_name": "@Pedro-qj4tj",
                "comment": "Omnibook at 899 right now at Bestbuy, only copilot with Snapdragon Elite under 1000 dlls for sale, at 899 is it worth it?",
                "likes": 0
            },
            {
                "author_name": "@JustaKhorne",
                "comment": "I wish there was someone covering the Indian market on points that I actually care about with such accuracy",
                "likes": 1
            },
            {
                "author_name": "@vivekkodira",
                "comment": "Thanks",
                "likes": 1
            },
            {
                "author_name": "@Coconutgl",
                "comment": "MacOS 8gb ram is not the same as win11 8gb ram. You can run macOS with 8gb ram perfectly fine for normal office work, but it is very dump in win11 especially some ram is set for vram which cannot be used for the system therefore 16gb ram is the minimum required.",
                "likes": 0
            },
            {
                "author_name": "@captainsparkle-fingers2744",
                "comment": "Thx a bunch,friend! I been looking for a new laptop for my kid that's heading off to college nxt yr.🥲",
                "likes": 0
            },
            {
                "author_name": "@nizaramanchar8735",
                "comment": "I see no reason to buy this laptops besides for developing apps for them 😊",
                "likes": 0
            },
            {
                "author_name": "@ZhangMaza",
                "comment": "If you want to buy laptop, josh is the one to watch :)",
                "likes": 0
            },
            {
                "author_name": "@matthewsykes2646",
                "comment": "Perfect test! I can't wait to see what others OEMs can do with Ryzen AI and, in a month or so, what Intel can achieve with Lunar Lake. I hope they can deliver what they're aiming for, i need to upgrade my laptop but Windows on Arm isn't where it needs to be for my needs, so X Elite laptops are out of my radar, it will be either a Ryzen AI or Core Ultra 200 powered pc.",
                "likes": 0
            },
            {
                "author_name": "@ginglee4199",
                "comment": "What's the name of the song in the sound test",
                "likes": 0
            },
            {
                "author_name": "@frofrofrofrofro24",
                "comment": "Solid vid, ayyo Cierra absolutely carried the video, excellent breakdown of laptops and honestly I will keep these in mind when I look for one in the future. Looking forward to seeing more vids from y'all",
                "likes": 1
            },
            {
                "author_name": "@mswork1764",
                "comment": "Why oh why do you keep talking about the GPU and gaming?  Qualcomm was quite clear that these chips aren't for GPU intensive work. You might as well talk about how these laptops aren't good for running supercomputer tasks, lol.",
                "likes": 0
            },
            {
                "author_name": "@CO8848_2",
                "comment": "Sonce zen5 is better, why buuy any?",
                "likes": 0
            },
            {
                "author_name": "@m4saurabh",
                "comment": "Amd goes nice try Qualcomm, but I'd win because I used AI in the naming scheme.",
                "likes": 0
            },
            {
                "author_name": "@FoxxFire",
                "comment": "I love that the staff are all taking turns behind the camera.  I think Sierra (or Cierra?) did an 8.5 out of 10, especially considering that I don't recall seeing her behind the camera before (maybe i just missed it though).  The small critiques i would have are that perhaps she can project a little more; her voice trails off just a little at the end of a sentence; and she goes a little fast when talking about technical things like computer specs.  With that said, she is an outstanding communicator, is very engaging and her appreciation for technology just bleeds through (you can't fake that).  Anyway, thanks for another great video JJ and team.",
                "likes": 0
            },
            {
                "author_name": "@jpnzo2k12",
                "comment": "Nice AI co-presenter!",
                "likes": 0
            },
            {
                "author_name": "@Cleisthenes607",
                "comment": "I can't concentrate on this video after reading the post of the moron on the wallstreetbets subreddit who inherited $700k from his grandmother and put it all in Intel stocks just before earnings where they missed earnings catastrophically, announced firing 15% of their entire workforce and suspended their dividend. It's down over 25% in less than six shours. This idiot lost over $200k in less than a working day of decades of blood, sweat and tears of his grandmother.\n\nIt's gone viral on all the investment subreddits.",
                "likes": 0
            },
            {
                "author_name": "@prathxmu8905",
                "comment": "Only just came across ur channel recently - loving ur content!!",
                "likes": 1
            },
            {
                "author_name": "@senhorkorracha",
                "comment": "1,2k for a light-task notebook is just... ugh",
                "likes": 1
            },
            {
                "author_name": "@blueeyednick",
                "comment": "daily reminder snapdragon laptops are ewaste",
                "likes": 0
            },
            {
                "author_name": "@leonardwise5807",
                "comment": "Josh can't wait for your ProArt P16 review. I just hope you don't get too jealous when you realize it is a better laptop than your godtier Mac Book Pro, not Max. You can always put your Mac Book Pro on the blazing Phoenix sidewalk and watch it turn into liquid metal. I'm surprised you don’t get the Asus two and one instead of the Microsoft though Microsoft makes a quality laptop, but for a secondary laptop it's more flexible, Youcan use it for more preformant tasks and don’t have app limitations and you can game on it. Maybe a little more therapy will help 😊",
                "likes": 0
            },
            {
                "author_name": "@alexs.5107",
                "comment": "Can you do real battery tests unlike the fake and incomplete ones you show us?",
                "likes": 0
            },
            {
                "author_name": "@lcy81",
                "comment": "what i care is that posible to run Llama3.1 on Windows Arm?",
                "likes": 0
            },
            {
                "author_name": "@TheoneandonlyRAH",
                "comment": "She was great on screen!",
                "likes": 0
            },
            {
                "author_name": "@admiralspyro9722",
                "comment": "\"... in fact I actually bought one\" (surface laptopl). The laptop is great, but it would have been better with a x86 chip.",
                "likes": 0
            },
            {
                "author_name": "@IosifViorelMila",
                "comment": "Great comparison video, as always. Would be great if you could compile a list of ARM native apps for Windows and publish it on your website. This way we can always stay up-to-date with the latest ARM apps available for Windows. Also, I know that the Surface Pro 11 is not a \"laptop\" and more of a 2-in-1 device, but it's still a Windows PC. Maybe you can review it as well along with the other Copilot+ devices.",
                "likes": 1
            },
            {
                "author_name": "@pyaesonekyaw6800",
                "comment": "Keep it up 👍",
                "likes": 2
            },
            {
                "author_name": "@Roboloved",
                "comment": "Are the new generation of Ryzen AI processors capable of running AI features, such as live captions, like Snapdragon processors? And, about the battery, Ryzen AI processors are similar with ARM processors?",
                "likes": 0
            },
            {
                "author_name": "@jasonho8400",
                "comment": "Hey josh, heres a really cool idea for your website. if you standardise all the battery and performance tests across all the laptops you test, it would be really great if there was a section in your website to compare several laptops battery, performance, power draw, or efficiency through graphs and the data that you have collected. i know it could be hard to implement, but this is just an idea ;)",
                "likes": 1
            },
            {
                "author_name": "@mortinocano169",
                "comment": "Congratulations on your new colleague! She's doing an amazing job. And what a review/comparison! I commend you guys. 😊",
                "likes": 0
            },
            {
                "author_name": "@joevwgti.",
                "comment": "I have the Thinkpad T14s 12core snapdragon, 32GB ram, 1TB nvme. I liked it over the other Lenovo's, because of the port options, and correct location of the FN key. It's as quick to render video(h.264) as any nvidia equipped(3050 mobile, or ARC) xps I've used, but absolutely cannot scrub through video without proxies. I know it was never designed to do this. I just went with this option as all the other Intel/AMD options felt like an iteration from last year, in the same case(because they are).",
                "likes": 0
            },
            {
                "author_name": "@ShinigamiDa",
                "comment": "No headphone jack in the lenovo model is a joke.",
                "likes": 0
            },
            {
                "author_name": "@HilareBelloc",
                "comment": "Im green when it comes to tec and laptops. I want to buy a laptop with 16 memory so i can use it for ai and video editing and Photoshop. I was thinking of buying vivobook snap, but will i regret that because the vicobook won't be good for them? Someone help, please",
                "likes": 0
            },
            {
                "author_name": "@jockos",
                "comment": "What about the Acer? It's the cheapest snapdragon in my region, but still sports an OLED.",
                "likes": 0
            },
            {
                "author_name": "@maestro69hz",
                "comment": "Good video, but I'll be going for the Lenovo Thinkpad T14s Gen 6 (Snapdragon). That one wasn't covered but looks like the best of the bunch.",
                "likes": 1
            },
            {
                "author_name": "@falconsuae9843",
                "comment": "والنعم فيك يا جوش 👏 🔥",
                "likes": 0
            },
            {
                "author_name": "@leakyabstraction",
                "comment": "I'm so far extremely happy with my 13.8 inch Surface Laptop 7 with X Plus. For someone who has a gaming desktop, it's a perfect companion device for mobile work and browsing. I would be happy to have better gaming performance and compatibility, and generally I might prefer to have a Zen 5 architecture device, but as a whole package it's incredible. For the first time in my life I actually enjoy using the trackpad, even clicking on it. Previously I couldn't imagine not wanting to use a mouse with a laptop, but this is just perfect.\n\nAlso, it feels super fast & snappy for general use. :)",
                "likes": 4
            },
            {
                "author_name": "@Pokeonrocks5",
                "comment": "The speaker test was awesome!",
                "likes": 3
            },
            {
                "author_name": "@engineering_guy",
                "comment": "What is the point of doing all those benchmarks and comparison based on performance when the final recommendation is to use it for light tasks like office, web and movie watching. Intel and amd processors from 3 years ago can do these tasks equally well. I think the target audience is much better served by finding a heavily discounted version of premium laptops from 2 or 3 years ago. The only hit will be battery life.",
                "likes": 0
            },
            {
                "author_name": "@nsaylor97",
                "comment": "That Cierra person seems well spoken, more of her please!!!",
                "likes": 0
            },
            {
                "author_name": "@Caponica23",
                "comment": "Insane value!",
                "likes": 0
            },
            {
                "author_name": "@irata2006",
                "comment": "Great video, guys!  You are THE channel for productivity laptop reviews.",
                "likes": 1
            },
            {
                "author_name": "@AJWilliams2014",
                "comment": "OK, what if I get the OLED XPS 13 for $1100 out the door? Would the XPS be part of the top list then? I had the Slim 7X (build and color are terrible) and Surface Pro (did not like that I had to pay 1500 and did not include a keyboard or pen!)",
                "likes": 0
            },
            {
                "author_name": "@geoffreyagaskins302",
                "comment": "Really great review! Thanks. Great job, Sierra!",
                "likes": 5
            },
            {
                "author_name": "@alankefauver6187",
                "comment": "Bought a Slim 7x and a X1 carbon both configured about the same. Sent the X1 back. The Yoga is going to Africa on Safari with me. My \"big\" laptop is an MSI Z16 with an i9 and 32GB RAM. My Desktop is built i7 with 64GB RAM. So far the Yoga does 90% of what the other two do albeit a little slower. Biggest down as a wildlife photographer, is that the Yoga runs LR and PS native, but LrC in emulation. The Yoga has a hard time with the AI Sharpening and noise reduction in all the above plus Luminar Neo, and Topaz PAI and DxO  PR4 don't run at all. Just my $0.02. Love your reviews.",
                "likes": 8
            },
            {
                "author_name": "@pictograph",
                "comment": "Useless ARM computers, I have no doubt that the chip inside is good, but what insults the intelligence is that Windows on ARM is heavy garbage and that there is nothing useful for it that would justify the purchase of such a computer. Unless you're a masochist who specifically wants that chip to use a web browser on it. There are ultrabook computers with real chips inside x86 that can do much more for the same money and there is no way that ARM chip can surpass them, primarily because of the software support in the form of programs. The biggest culprits for the decline of the market are currently Apple and Microsoft, everything in the development of hardware is at a standstill because of those two companies, their demise would bring real freshness and progress to the market.",
                "likes": 0
            },
            {
                "author_name": "@kotenkostiantyn1282",
                "comment": "Shnapdragon laptops are Best to make a hype on internet, but not much more. General recommendation would be to avoid any of them",
                "likes": 0
            },
            {
                "author_name": "@SJG33",
                "comment": "I know these are ARM chips but surely AMD have the power to combine these with Nvidia GPU's to get into the gaming side when needed and then more Macbook Pro qualities when not",
                "likes": 0
            },
            {
                "author_name": "@atharvachandra9968",
                "comment": "Thinking of maxing out 13.8 inch surface with 32 gigs of ram and 1td of hd. Seeing this video discouraged me a bit. Want something that can breeze through heavy excels and raw dslr photo editing (hobby). What do you think? Don’t want 15inch coz portability is important too.",
                "likes": 0
            },
            {
                "author_name": "@aras_aras_aras_aras",
                "comment": "1:56 I am quite surprised that the new AMD Ryzen AI processors offer similar performance to Snapdragon at the same wattage, but their battery life is much worse than Snapdragon. Maybe AMD needs better tuning or drivers to improve the efficiency during light tasks on Windows. \n\nGiven these useful graphs, I would expect a video that compares the processors with each other in terms of battery life and performance at different power levels. With this efficiency of the new Ryzen AI processors, going for Snapdragon may not be worth due to its compatibility issues and low graphics performance. What's also important is that, the Snapdragon processors may slow down GUI animations, scrolling, or window management operations (like the Task View) when multiple high-resolution monitors are used.",
                "likes": 1
            },
            {
                "author_name": "@rael_gc",
                "comment": "I don't know the name of the lady talking about the models, but her pronunciation at that speed is amazing! Very glad to hear!",
                "likes": 9
            },
            {
                "author_name": "@marekkedzierski8237",
                "comment": "Why would anyone buy those Snapdragon laptops when new AMD chips are so much better?",
                "likes": 0
            },
            {
                "author_name": "@johnhodgson4216",
                "comment": "The Dell Laptop has a 64gb and 1Tb option, autodesk min is 16gb and recommended 32gb ram. The autodesk has a AI NPU interface option, which the reason I am purchasing a laptop is the NPU and its applications to software. Is there a difference from 32gb using Autodesk software, or getting 64gb having a 32gb buffer. is there a Desktop with the NPU chip included. would the 64gb have higher heat problem? Fan Noise means nothing for me, having a laptop that doesn't have a cooling problem means a lot for me.",
                "likes": 0
            },
            {
                "author_name": "@inamulbhuyan",
                "comment": "Snapdragon X Elite 🔋🔋🔋💪",
                "likes": 0
            },
            {
                "author_name": "@durmoth7027",
                "comment": "Would like to know the most recommendable laptop for programming with jetbrains ide *probably a zen5 one :)",
                "likes": 0
            },
            {
                "author_name": "@kidthegeek",
                "comment": "I just bought a vivobook s15 with 32gb ram. It runs so nice and smooth.\n\nMy biggest issue is im disappointed in copilot. I'm struggling with the decision to keep the laptop or return it.\n\nLike i said it runs super smooth. I run ttrpgs online and this can easily handle Foundry for me. Sure my ram use is close to 50% most of the time, but that's fine. I can save a lot of money by getting an intel laptop with 16gb of ram and am trying to make up my mind aa to which way i will go.",
                "likes": 1
            },
            {
                "author_name": "@chitambomwape1389",
                "comment": "Which is best for programming?",
                "likes": 0
            },
            {
                "author_name": "@user-zn1db9fe5w",
                "comment": "And in Poland laptop with 1300 $ = 1800$ sic",
                "likes": 0
            },
            {
                "author_name": "@eraditortv",
                "comment": "The speaker test is one of the best Ive ever come across period. Customers should absolutely wait before buying these. The lack of compatibility is purely dreadful. Also...Waiiiiitttttttttiiiiinnnnngggg for the galaxy book 4 pro 16 inch😅😅.",
                "likes": 0
            },
            {
                "author_name": "@PastafarianLemur",
                "comment": "I love the promise of these ARM SoCs but far more software desperately needs to be ported over to Windows on ARM.  It's bad enough that I'd suggest that Microsoft just give away dev tools or flat out pay developers to port their apps over.  Yes, it's not an ideal move for MS' balance sheet in the short term, but if they don't do something drastic it's gonna take a very long time (if ever) for WoA to be any sort of real competition for Apple's MacOS.",
                "likes": 0
            },
            {
                "author_name": "@nameless_stranger",
                "comment": "You're starting to become my favorite amongst Matthew Moniz, Jarrod, and Dave2D. Shoutout to Tech Guy Beau as well",
                "likes": 0
            },
            {
                "author_name": "@JingSkyJoker",
                "comment": "How many people know how to switch to performance mode? \nShould we have performance on default / balance mode?\nI always stick with balance mode, but I am surprised as I found my Vivobook SD XE default is at efficient mode.",
                "likes": 0
            },
            {
                "author_name": "@shivanshshivi811",
                "comment": "Hey josh, been a long time viewer.\nI am a bit troubled as to which lappy i should buy myself, asus rog strix 16 or legion pro 5i, could you maybe try to review them too( i couldnt find them) and should I be buying a HX processor laptop?",
                "likes": 0
            },
            {
                "author_name": "@tastywheatus",
                "comment": "Loving my 7x. Upgraded from a Surface Pro 3 which struggled to do anything, and the responsiveness, screen, and battery life are all top notch.",
                "likes": 1
            }
        ]
    },
    {
        "video_id": "H71IxqmCfxQ",
        "video_title": "Watch this BEFORE You Buy a Laptop!",
        "comments": [
            {
                "author_name": "@TheMysteriousTech",
                "comment": "Celebrate the magic of Christmas with our festive deals!!! \n62% off Coupon Code:【TMTV62】 \r\nOffice 2021 Pro Plus (1 PC) - $28 https://bit.ly/41dOoOg \r\n2 Office 2021 Pro Pack - $48 ($24/PC) https://bit.ly/3uOS1he \r\n3 Office 2021 Pro Pack - $66 ($22/PC) https://bit.ly/41mSK5P \r\n\r\n50% off Coupon Code:【TMTV50】 \r\nWindows 10 Pro ($8) https://bit.ly/3RBzkXD \r\nWindows 10 Pro - 2 PC ($15) https://bit.ly/3TcZSiT \r\nWindows 11 Pro ($13) https://bit.ly/47MyWv2 \r\nMore: https://www.keysfan.com/merry-christmas-sale-tmtv.html?ksf=vtmt83",
                "likes": 397
            },
            {
                "author_name": "@DarAlulfaInstitute",
                "comment": "❤❤❤ thank you so much for the good idea",
                "likes": 0
            },
            {
                "author_name": "@SI3GEL",
                "comment": "💡You Sir are a blessing. Shukran 🙏🏼",
                "likes": 0
            },
            {
                "author_name": "@Your_Bluee",
                "comment": "But, why now?\nWhy YouTube is suggesting that video after I’ve already bought a laptop?😑\n\nAnyways, thanks for this amazing and direct content! ❤",
                "likes": 1
            },
            {
                "author_name": "@vishnunair2823",
                "comment": "This guy is a legend",
                "likes": 0
            },
            {
                "author_name": "@vostrak2511",
                "comment": "Also a really good thing to look for is decent build and nice cooling, bcs, when you play, you really don't want hot laptops👍",
                "likes": 1
            },
            {
                "author_name": "@Ahmad-Gt911",
                "comment": "This is the only channel where 100%knowledge and benefit given, 0%intros and bullsh$t.\nKeep up the good work fam👏",
                "likes": 0
            },
            {
                "author_name": "@runtomusicasap",
                "comment": "Aman Tanrım! Bu kanalın tek türk abonesi ben miyim?😅",
                "likes": 1
            },
            {
                "author_name": "@flyer3154",
                "comment": "Too late",
                "likes": 0
            },
            {
                "author_name": "@allanbangsal-kj7iw",
                "comment": "Very importative",
                "likes": 0
            },
            {
                "author_name": "@JoseVillanueva-mm1iq",
                "comment": "Can you make a video for earbuds",
                "likes": 0
            },
            {
                "author_name": "@HH-fx6fz",
                "comment": "give us an example with AMD. Thanks.",
                "likes": 0
            },
            {
                "author_name": "@HH-fx6fz",
                "comment": "whaaat !, impressed with Intel ?",
                "likes": 0
            },
            {
                "author_name": "@HH-fx6fz",
                "comment": "IGNORE Intel , i5, i7, etc ... Buy AMD, the real McCoy.",
                "likes": 0
            },
            {
                "author_name": "@MrJhonnyJoin",
                "comment": "My respect to you sir.\nThank you for this video. \n👍",
                "likes": 0
            },
            {
                "author_name": "@hiddenhippo7338",
                "comment": "Straight to the point cheers, dont really no y u do this as a storm trooper not like your reviewing mafia based casinos, but I like the mask so all good :-)",
                "likes": 0
            },
            {
                "author_name": "@eilaly1199",
                "comment": "Sharing a knowledge is like making a someone forever rich. God bless you ❤",
                "likes": 0
            },
            {
                "author_name": "@speeektakuler",
                "comment": "🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷",
                "likes": 0
            },
            {
                "author_name": "@lockheedmartin3275",
                "comment": "Çok iyisin abi 😀 türkiyeli olduğunu anladım🎉",
                "likes": 0
            },
            {
                "author_name": "@selinafox7674",
                "comment": "im a \"stereotypical\" girl  who cant understand the specs but want to buy a gaming laptop so this is so useful! i don't need a boyfriend to help me anymore lol",
                "likes": 0
            },
            {
                "author_name": "@sonumalik..",
                "comment": "no nonsense straight to the point you are awesome",
                "likes": 0
            },
            {
                "author_name": "@whamio",
                "comment": "Much obliged Mysterious tech! I am considered a techie in my family so i have learned a few things from your video. Subscribed to learn more, keep it up Bro",
                "likes": 0
            },
            {
                "author_name": "@AnsonLan",
                "comment": "So helpful",
                "likes": 0
            },
            {
                "author_name": "@andrewarnold9642",
                "comment": "Extremely helpful information. Thank you.",
                "likes": 0
            },
            {
                "author_name": "@Splinter-ge9pf",
                "comment": "You explained RAM kinda too simply\n\nthere's a difference between DDR4 and LPDDR5 in terms of speed (8gb of 5 will be faster than 16 of 4 but it is a smaller amount)",
                "likes": 0
            },
            {
                "author_name": "@daffanur8246",
                "comment": "Guys please help me choice, I want to buy a laptop between Lenovo LOQ with intel i7 gen 13th HX series and rtx 4050 6GB or Asus TUF with amd ryzen 7 7435HS and rtx 4060 8GB. Which one is better for gaming?",
                "likes": 0
            },
            {
                "author_name": "@Gurpreetsinghpreet1",
                "comment": "Hello sir \nPlease upload a detailed video about Graphics cards",
                "likes": 0
            },
            {
                "author_name": "@ZeeshanAli-h6q",
                "comment": "explain well in 16 min of thousand of my question",
                "likes": 0
            },
            {
                "author_name": "@Jonathan-sk2gk",
                "comment": "I am confused wheather to HP victus or Dell G15 series .... \nCan u please suggest?....",
                "likes": 0
            },
            {
                "author_name": "@user-nh4zr3kw4r",
                "comment": "Well explained!",
                "likes": 0
            },
            {
                "author_name": "@NawtsOwO",
                "comment": "I just got a 1660ti laptop, 32gb ram, 1tb ssd, magnesium alloy casing, and pretty quiet fans. Plus it has a 10 hour battery life. It was 399.99 free shipping. ^_^",
                "likes": 0
            },
            {
                "author_name": "@JumirChari12",
                "comment": "Thank you so much for infos, good thing i find this video, thank u",
                "likes": 0
            },
            {
                "author_name": "@antonioalvarez4780",
                "comment": "Damn. This guy is good.",
                "likes": 0
            },
            {
                "author_name": "@gudlutripathy3283",
                "comment": "Ordered a Samsung galaxy book 2pro for the research work of my daughter.",
                "likes": 0
            },
            {
                "author_name": "@Rio-ss5ui",
                "comment": "Which laptop to buy in India from 30k to 60k please do a video ❤from India",
                "likes": 0
            },
            {
                "author_name": "@darrenking2231",
                "comment": "I love this guy!",
                "likes": 0
            },
            {
                "author_name": "@CalypsoDarling",
                "comment": "AI video and all this is very informative",
                "likes": 0
            },
            {
                "author_name": "@eldhosemani3463",
                "comment": "Thank you...",
                "likes": 0
            },
            {
                "author_name": "@jasperjohndegueno5357",
                "comment": "Thank you for the tip honestly I just buy  laptops based on the price because I thought that's what determines the Laptops quality, but thanks to your video \n\nI can buy  an affordable laptop based on its specifications",
                "likes": 0
            },
            {
                "author_name": "@alb6804",
                "comment": "Im looking to buy a laptop. Thanks",
                "likes": 0
            },
            {
                "author_name": "@neettim",
                "comment": "Where is the \"Watch this before you buy a PC\" video?",
                "likes": 0
            },
            {
                "author_name": "@unyimejacob7408",
                "comment": "God bless you, you just save me some money.",
                "likes": 0
            },
            {
                "author_name": "@cody_kev",
                "comment": "is the asus vivbook s 14 flip ryzen 7 7330u anygood?",
                "likes": 0
            },
            {
                "author_name": "@groovebear63",
                "comment": "Hi there. What kind of computer speakers. Are the ones behind you I’m looking to upgrade mine.",
                "likes": 0
            },
            {
                "author_name": "@douvicndilbe663",
                "comment": "Thanks for the explanation . Very clear!",
                "likes": 0
            },
            {
                "author_name": "@relaxer0_098",
                "comment": "but what about intel video cards?",
                "likes": 0
            },
            {
                "author_name": "@شهنشاه",
                "comment": "I want to study computer science, so please recommend a good laptop",
                "likes": 0
            },
            {
                "author_name": "@kamelkh",
                "comment": "Thank you very much",
                "likes": 0
            },
            {
                "author_name": "@sayaheinminkyaw6219",
                "comment": "Dell latitude 5490 model should be bought?",
                "likes": 0
            },
            {
                "author_name": "@the_professor2",
                "comment": "Please make a new video based on 2024.",
                "likes": 1
            },
            {
                "author_name": "@backhandya1",
                "comment": "get a spiderman mask",
                "likes": 0
            },
            {
                "author_name": "@backhandya1",
                "comment": "people forget they are buying a mobile chip thats not same as a desktop",
                "likes": 0
            },
            {
                "author_name": "@justlearning7411",
                "comment": "Quality content no bullshit❤ I like it bro, keep up the good work😊",
                "likes": 0
            },
            {
                "author_name": "@LuzuVlogsGamer",
                "comment": "You forgot to add Optimus for the Laptops that are leaker in performance like RTX 3050 or Ti (And other previous generations) when its not plugged in it will use the Integrated graphics(of the processor) rather than the actual GPU when its plugged in (rtx 3050 ti in this case). Laptops that have an Option to disable Optimus and use the Dedicated GPU like RTX 3060 and above  Can run more demanding games without being plugged in the wall with the power chord. (It can be a problem because it switches from integrated to Dedicated Automatically when you dont want to for example: \nOculus Air Link app for PC doesnt recognize the Dedicated GPU rtx 3050 ti and uses the integrated graphics of the processor (even when plugged in) since Optimus manages that Directly and you cant do anything, unless your Laptop supports manual control of it,which gives horrible performance when trying to use the Headset unless using the cable directly )",
                "likes": 0
            },
            {
                "author_name": "@pouthaimei",
                "comment": "Nice video but currently I am planning to buy desktop i5 14th gen.",
                "likes": 0
            },
            {
                "author_name": "@Bumi-rs2ip",
                "comment": "Can I buy a business laptop n still use it to program my codes??",
                "likes": 0
            },
            {
                "author_name": "@pierrehenriot2480",
                "comment": "Buyers, do yourselves a favour and buy a laptop with at least 3 SSD slots and install the system and important data/apps on 2x 500GB SSDs with RAID-1. This will prevent a total system crash if a system SSD fails. \nUse the third slot for a large capacity drive for data that's less important.\nA great combo currently is i7-12800h and RTX 4050 6GB",
                "likes": 0
            },
            {
                "author_name": "@gamgam2252",
                "comment": "Where did you get the mask?",
                "likes": 1
            },
            {
                "author_name": "@rachel5658",
                "comment": "Very informative video ⭐⭐⭐⭐⭐",
                "likes": 0
            },
            {
                "author_name": "@shahidkococaccount3853",
                "comment": "We need part2 video🙏",
                "likes": 1
            },
            {
                "author_name": "@CuriosumAvlayan",
                "comment": "8:32 zurt firma zort bilgisayar :D neyse teşekkürler çok sağlam video, işime yaradı ❤",
                "likes": 0
            },
            {
                "author_name": "@keremkarnak1340",
                "comment": "Abimm globale acilmis",
                "likes": 0
            },
            {
                "author_name": "@keremkarnak1340",
                "comment": "Abimm globale acilmis",
                "likes": 0
            },
            {
                "author_name": "@hellocharis",
                "comment": "Thank you so much for this video!  Can you please explain more about “business use” laptops? How to choose between G1 G7 Y U? Also which brands would you recommend among them? (Please see this comment & please make a video about it) 😊🥺🙏🏻🙏🏻",
                "likes": 0
            },
            {
                "author_name": "@sophiesirchin5216",
                "comment": "After my old HP proBook broke down and could not charge, my mission began to find myself a good laptop that will suit my needs. Ofcourse I now know BUSINESS is where I belong with all the insights. Thank you so much for this detailed video. Am an IT/COMP DWARF but I understood everything. 😊 Thanks alot",
                "likes": 0
            },
            {
                "author_name": "@elitium-e4e",
                "comment": "what does hk and hx, k  mean",
                "likes": 0
            },
            {
                "author_name": "@elitium-e4e",
                "comment": "thanks",
                "likes": 0
            },
            {
                "author_name": "@user-df5zm8pm1u",
                "comment": "im watching this after i bought a laptop ",
                "likes": 0
            },
            {
                "author_name": "@user-ui5ew",
                "comment": "got myself an untouched Inspiron 14 plus 7420 for around €600",
                "likes": 0
            },
            {
                "author_name": "@joaogamer2502",
                "comment": "BRO THAT IS LITERALLY WHAT I GOT I SAW A LAPTOP 600 DOLARS RYZEN 7 16 GB RAM I JUST DIDNT SEE THE GRAPHICS CARD SPEC AND THE FACT THAT THE RYZEN WAS ONLY SERIES 4000",
                "likes": 0
            },
            {
                "author_name": "@GrayGideon-i1p",
                "comment": "Your information was invaluable to me",
                "likes": 0
            },
            {
                "author_name": "@asheryoung7061",
                "comment": "Got everything I need to know about computers in 16mins👌",
                "likes": 0
            },
            {
                "author_name": "@bangrior9301",
                "comment": "Nice. Since i found the video inalready own a lenovo ideapad 😂 with amd-9125 processor with integrated radeon r3 to watch films, series anime. But how much this guy explains. Daaaamn he is underrated. Love this guy",
                "likes": 1
            },
            {
                "author_name": "@MOHAMEDT97",
                "comment": "Great knowledge. 👍  Thank you",
                "likes": 0
            },
            {
                "author_name": "@bruh-oj8hg",
                "comment": "15:04 takes some fiddling around but you can modify that so performance does not decrease when unplugged in",
                "likes": 0
            },
            {
                "author_name": "@yottahertz",
                "comment": "I subscribed because of your Channel name",
                "likes": 0
            },
            {
                "author_name": "@Summerbrah",
                "comment": "crazy good video",
                "likes": 0
            },
            {
                "author_name": "@DORDOBU",
                "comment": "Bunu mu demek istediniz?",
                "likes": 0
            },
            {
                "author_name": "@vigneshhthinakaranofffi",
                "comment": "I must say that this video is everything one needs to understand before buying a laptop.. (Even if they don't plan to buy anytime soon 😅)",
                "likes": 0
            },
            {
                "author_name": "@Cam1417-TK",
                "comment": "Amazing!",
                "likes": 0
            },
            {
                "author_name": "@kodaph",
                "comment": "The main deciding factor is your budget and how much you'd be willing to pay...\n\nIt will all check out, esp. at these modern days where laptops are mostly with SSDs even the entry levels...\n\nSo, have a budget and decide from there.",
                "likes": 1
            },
            {
                "author_name": "@pumpkinut5314",
                "comment": "Straight to the point, no bullshit. New sub earned",
                "likes": 0
            },
            {
                "author_name": "@Haji-005",
                "comment": "Thanks for the video 😊",
                "likes": 0
            },
            {
                "author_name": "@moroccostar",
                "comment": "God bless u",
                "likes": 0
            },
            {
                "author_name": "@hupturiiiikk",
                "comment": "kanka nie turkce kullanion",
                "likes": 0
            },
            {
                "author_name": "@mr.nemlioglu",
                "comment": "Oo kardeşim iyisin he :D",
                "likes": 0
            },
            {
                "author_name": "@ne3tonmoy",
                "comment": "Thanks for the advice and information.awesome video!❤",
                "likes": 0
            },
            {
                "author_name": "@nostalgicangel01",
                "comment": "Really well done! I wish I had found this video sooner. I've had bad experiences with Asus and Acer gaming laptops. I'm an editor, so I decided to get my first Alienware laptop with really good specs, but it ended up being a dud. Thankfully, I was able to return it before the return period expired, but it sucks bc it was a beautiful looking laptop and I was really excited for my first alienware laptop. Now I have the tools to make a more informed decision regarding my next laptop. If you can, please do a more in-depth video expanding on what you've already done in this one, thanks!",
                "likes": 0
            },
            {
                "author_name": "@alittletrickery",
                "comment": "So my Mac is good for something. Huh.",
                "likes": 0
            },
            {
                "author_name": "@boyankonov7291",
                "comment": "Thank you friend for the review",
                "likes": 0
            },
            {
                "author_name": "@mobsenzy",
                "comment": "❤❤❤",
                "likes": 0
            },
            {
                "author_name": "@mobsenzy",
                "comment": "❤❤❤",
                "likes": 0
            },
            {
                "author_name": "@agatkamakwiatka",
                "comment": "This is absolutely amazing video!! I am so thankful I waited with running to the store to buy a laptop! I will do my research now ❤",
                "likes": 0
            },
            {
                "author_name": "@nilhyo",
                "comment": "I am a girl who has never owned a laptop and knows NOTHING about laptops. This video was EVERYTHING I needed and more, thank you so much!",
                "likes": 78
            },
            {
                "author_name": "@robinbreedon",
                "comment": "I don't normally get advice about laptops that aren't Macbooks but when I do, I get it from a Storm Trooper.",
                "likes": 0
            },
            {
                "author_name": "@PotatoNuggetBoi",
                "comment": "I've had quite a few gaming laptops over the past few years. I always tell my friends to watch out when buying them no point in overpaying for less performance to be fair I tell them the same with buying desktops. Just be informed with what you're buying so you don't get bamboozled. *I thought this video was about privacy .... I hate A.I.*",
                "likes": 0
            },
            {
                "author_name": "@Aj-cd1in",
                "comment": "GOAT",
                "likes": 0
            },
            {
                "author_name": "@r.e.r.e.2877",
                "comment": "Loved the video; learned things I've always wondered about and helped decide which laptop to purchase next - Thumbs Up!",
                "likes": 0
            },
            {
                "author_name": "@Yandere_mp4",
                "comment": "I almost choose wrong and bad laptop but thanks to u i understood which one should i get",
                "likes": 0
            },
            {
                "author_name": "@abdooMohamed-wy3nv",
                "comment": "Nowadays is Lenovo legion 5 model \n15ITH6 with i7 11th 11800H\nRam 16\nSsd 512\nRtx 3050ti \nGood value for gaming at medium budget",
                "likes": 0
            }
        ]
    },
    {
        "video_id": "oV0j41Qugm0",
        "video_title": "12 Tips for Buying a Laptop - You NEED to Know! (2024)",
        "comments": [
            {
                "author_name": "@Thetechchap",
                "comment": "Hey Chaps! What laptop are you rocking right now? 🤔\n\n(Also apologies for my horsey voice, it took me forever to film this hah)",
                "likes": 27
            },
            {
                "author_name": "@norexp",
                "comment": "C  Soon - ,,.",
                "likes": 0
            },
            {
                "author_name": "@TheVonnieVonVonShow",
                "comment": "Windows All Day 💯",
                "likes": 0
            },
            {
                "author_name": "@Yatukih_001",
                "comment": "Thanks for the video!!",
                "likes": 0
            },
            {
                "author_name": "@LeicaM11",
                "comment": "You need to say, that Qualcomm Snapdragon X Elite Chips were designed by former top engineers, having designed those Apple MX-series processors before. There startup Nuvia just had been acquired by Qualcomm.",
                "likes": 2
            },
            {
                "author_name": "@geantrabal3485",
                "comment": "Recommended laptops?????? Linkksssss???",
                "likes": 0
            },
            {
                "author_name": "@bojassettsd",
                "comment": "Thanks, I was wondering if I should be waiting for some new AI generation of laptops. But I had a hunch about your summary, that AI doesn't really mean that much yet.",
                "likes": 1
            },
            {
                "author_name": "@GrayGideon-i1p",
                "comment": "I am looking for a 4K video editing laptop to buy this year.",
                "likes": 0
            },
            {
                "author_name": "@The_Penguin_City",
                "comment": "Geomátics!",
                "likes": 0
            },
            {
                "author_name": "@Backpfeifengesicht45",
                "comment": "I use a Nexdock. Plug my S24 Ultra phone into it and I'm good to go.",
                "likes": 0
            },
            {
                "author_name": "@67daltonknox",
                "comment": "I got an ACER Aspire for under $300 on Prime Day a couple of years back. I did put in a hard drive to store a CD archive. It does everything I need well.",
                "likes": 0
            },
            {
                "author_name": "@thechicotube96",
                "comment": "What if i want linux?",
                "likes": 0
            },
            {
                "author_name": "@Tokomak_5",
                "comment": "15:19 I do use exclusively microSD cards. Much much more convenient than the SD cards.",
                "likes": 0
            },
            {
                "author_name": "@DCee15",
                "comment": "ASUS Vivobook S15 OLED vs Samsung Galaxy 4 Edge?",
                "likes": 0
            },
            {
                "author_name": "@user-fw7te2yt9t",
                "comment": "Is 15 inches laptop too big for a student ?",
                "likes": 2
            },
            {
                "author_name": "@randalcalvert270",
                "comment": "Epic Information here my sir 👏🏻",
                "likes": 0
            },
            {
                "author_name": "@noeminoarin8273",
                "comment": "Recommendation pls what 14”laptop to buy to use for study and business and web browsing?",
                "likes": 0
            },
            {
                "author_name": "@harrisonbanda4921",
                "comment": "I know its always good to buy the latest and greatest but feel a round up of previous gen laptops worth buying still would be appreciated, just a thought 😁",
                "likes": 0
            },
            {
                "author_name": "@lucutes2936",
                "comment": "13:10 ghost",
                "likes": 0
            },
            {
                "author_name": "@hk10ish",
                "comment": "I'm gonna start my career in cybersecurity. Suggest me a laptop by directly its brand name and brief specifications.",
                "likes": 0
            },
            {
                "author_name": "@AbulWafa434",
                "comment": "@Thetechchap\nI'm a teacher i use Zoom for around 7 to 8 hours a day and i have around 40 tabs (pdf) open at the same time, which laptop will be best for me?",
                "likes": 0
            },
            {
                "author_name": "@MNM14ful",
                "comment": "Thanks for this very informative tutorial.  Which moderately priced laptop would you recommend for use with video editing software (MiniTool/Clipchamp)?",
                "likes": 0
            },
            {
                "author_name": "@nicholashoward2696",
                "comment": "I am using a Chuwi laptop does the basics and some light gaming full HD screen 8gb ram 128gb ssd but can be upgraded fairly cheap also around £200",
                "likes": 0
            },
            {
                "author_name": "@iamcarl4591",
                "comment": "As for tablet \nI'd argue the Samsung Tab is actually way more useful with its Dex mode and a proper drawing display by webcom.\n\nAlso, most features you mentioned on Mac OS are actually available on Windows.",
                "likes": 0
            },
            {
                "author_name": "@adrianlador937",
                "comment": "Hi there. I have a question about buying an M1 Pro but ex display! Is it worth it? It doesn’t come in its original box but all original accessories. Sold on eBay, London seller. Thanks",
                "likes": 0
            },
            {
                "author_name": "@quizztube_tv",
                "comment": "Thanks man",
                "likes": 0
            },
            {
                "author_name": "@carmalitarobertson1226",
                "comment": "Question: I need to buy a laptop for day trading to run a specific software and wondering what you recommend?\n\nThe software requirements:\n- Windows 11\n- 2GHz or faster quad core 64-bit processor\n- 8gb RAM\n- DirectX 10 compatible graphics card\n- SSD Hard Drive",
                "likes": 0
            },
            {
                "author_name": "@MrBobWareham",
                "comment": "You missed Linux better than Windows or Mac!! No spyware",
                "likes": 0
            },
            {
                "author_name": "@cinspain08",
                "comment": "would love to know your thoughts on best laptop for work and browsing for £400",
                "likes": 0
            },
            {
                "author_name": "@jasonburns1352",
                "comment": "i use the acer chromebook spin 714 high spec version which i got from acer direct on ebay its certifed refurbished and got it half price with the pen with great value far the price",
                "likes": 0
            },
            {
                "author_name": "@pl4423",
                "comment": "How about buying older flagship laptops for cheap rather than buying current low or mid-range laptops with average specs???🤔",
                "likes": 13
            },
            {
                "author_name": "@koukimonzta",
                "comment": "I got me an M1 macbook air from Walmart.  Fantastic system fantastic price !",
                "likes": 3
            },
            {
                "author_name": "@henriquemiguel95",
                "comment": "For me is easy: 14'', upgrade options (ssd, ram and battery), max weight of 1,5 kg and a powerfull cpu. My preference are Thinkpads but I'm open to any option.",
                "likes": 1
            },
            {
                "author_name": "@user-nj3sz2ki2f",
                "comment": "why are budget apple models M3 and the new Windows surface laptops (snapdragon) so much more expensive in Europe? The cheapest apple and windows are somewhere around 1300 to 1500 euro",
                "likes": 0
            },
            {
                "author_name": "@nelmarcpgarcia123",
                "comment": "Can i have of those ewaste😅",
                "likes": 0
            },
            {
                "author_name": "@NoName-zf6nr",
                "comment": "Almost all reviewers like you ignore certain aspects that are essential to me:\n\n- Notch. I will never buy any. This means that current Macbooks are not, although reviewers suggest, equally worth comparing to other devices.\n\n- If devices have fans, their cleaning must be easy or I do not buy them.\n\n- Batteries must have easy replacement, acceptable prices and manufacturer statements on long availability. Otherwise, I do not buy any device other than cheap ones.\n\n- Keyboards must provide a typing experience similar to a mechanical desktop keyboard. Whenever, however, I try countless keyboards of mobile devices in stores, even the best ones are unacceptable crap. I cannot use such. Maybe Cherry MX Low Profile would be acceptable but I cannot know because such is never shown in stores here and some manufacturers only offer it with US layout while I need German layout.\n\n- Ergonomics includes ordinarily sized arrow keys and four page navigation keys. Keyboards without such I do not buy.\n\nAlthough the mining and Corona crisis prevented me from building an RTX 3000 desktop, above criteria meant that no mobile device was acceptable. With a 3 years delay, I built an RTX 4000 desktop. Seeing current mobile devices, nothing has changed - they are still unacceptable because of not fulfilling above criteria. If this state of the market continues, I will upgade my desktop instead of buying a mobile device. All those comparison reviews are immaterial as long as not all of my essential criteria above are fulfilled. You reviewers act on the assumption that there would be some mobile devices worth buying. This is not the case for users like me who have to resort to desktops despite their disadvantage of immobility. --robert jasiek",
                "likes": 0
            },
            {
                "author_name": "@nephosl5292",
                "comment": "How is an ultra core 7 mid range😂. The ultra core 5 beats my gaming pc's 2700x, which is still totaly fine...",
                "likes": 0
            },
            {
                "author_name": "@dannyrozados",
                "comment": "Hi I am looking for a windows laptop for work office as I might start working on highbride 3 days at work 2 days at home £600 budget. 16 or 32 gigs ram 2tb ssd with good graphics and video editing. Any ideas in which one",
                "likes": 0
            },
            {
                "author_name": "@AhmedTelleserDehyer",
                "comment": "I watch your video by using Immersive Translate to help me. I have to say that this video provides good tips for me and  is really beneficial for me. Thanks for your sharing ❤.",
                "likes": 0
            },
            {
                "author_name": "@RicFlairSucks85",
                "comment": "BOOM, buy a Macbook Air M1...it's the cheapest, most functional, well-rounded, and best value of any laptop available today. Next Christmas I'm giving out 3 Christmas presents to friends of mine. I found a place where you can get refurbished ones (in great condition) for just over $400. Which is still well worth it today for sure. I've seen cheaper but not in as good of shape and not as trustworthy a seller. Also a big reason to buy Apple over any other Windows POS is because despite Apple being woke, they're nothing compared to communist Bill Gates whose company wokeness knows no bounds...and thus must be eradicated like other evil companies such as Disney. However, I will say this much I'm tired of seeing these awful wallpapers of Apple in their OS's, I had my friend go through the hard work of 'hacking' my iPhone just to delete them forever from my phone, so I wouldn't have to see them and their agenda they carry.",
                "likes": 1
            },
            {
                "author_name": "@markaznar1979",
                "comment": "I am tempted to get the Huawei mate x pro 2024. How is the gaming on it? Like for turn based modern games",
                "likes": 0
            },
            {
                "author_name": "@technicalvideopurna",
                "comment": "Very Beautiful vivid 4k HDR video compare to oth❤",
                "likes": 0
            },
            {
                "author_name": "@tabiriibrahim5369",
                "comment": "Please help me.\nI need a laptop with a good screen (oled, 2k or 3k, and 120 refresh rate), also 2 in 1 with stylus, for office work.\nWhich one should I buy?",
                "likes": 0
            },
            {
                "author_name": "@suhaimiss7322",
                "comment": "thank you very much for the more tips... especially the last tips (marketing) 😅😅😅",
                "likes": 1
            },
            {
                "author_name": "@YasinHasan",
                "comment": "where is the surface laptop 7 review?",
                "likes": 0
            },
            {
                "author_name": "@murtazachaudhary3339",
                "comment": "Very nice video",
                "likes": 0
            },
            {
                "author_name": "@yaroslav7328",
                "comment": "The Linux option wasn't mentioned. Linux compatibility is crucial for me since I don't use Windows at all. From a professional perspective as an IT professional, Linux is the best option for me.",
                "likes": 20
            },
            {
                "author_name": "@IImooksterII",
                "comment": "Bought a Macbook air M2 base model on sale. Surfing the internet, listening to music, watching movies. Works as well as possible. Super satisfied.",
                "likes": 1
            },
            {
                "author_name": "@bradavon",
                "comment": "If your budget is under £300, get a Chromebook. A Windows laptop will be plain unpleasant.",
                "likes": 0
            },
            {
                "author_name": "@bradavon",
                "comment": "You can get a perfectly solid Windows Laptop for £400. Don't get less than 8GB RAM and less than an Intel Core i3 CPU.",
                "likes": 5
            },
            {
                "author_name": "@bradavon",
                "comment": "Buy a Surface Laptop 7. It's awesome. Unless you like Apple, get a MacBook. Unless you Game, get a Gaming Laptop.",
                "likes": 0
            },
            {
                "author_name": "@johnblackledge4009",
                "comment": "Ah... I was womndering when it would come:\nThe old lie, that Chromebooks need to be on the Internet to be used.",
                "likes": 0
            },
            {
                "author_name": "@nerovanguard846",
                "comment": "I'm sorry Tom but your statement about not worrying to much about ports is, frankly speaking, very stupid \n\nThe reason why the MacBook has the \"the ultimate combination of ports\" as your said yourself, is because people complained about being adapters to use the MacBook. Back then it only came with literally USB C ports and nothing else. Dongle life was very real and people has had enough so Apple responded. Thankfully, Apple listened \n\nSo, no. You're absolutely wrong about \"just buy an adapter\"",
                "likes": 1
            },
            {
                "author_name": "@PikoPetek",
                "comment": "Well. I was looking for something around 1500US. Went to store and tried bunch of them. I discovered that for my regular use, I still need only FullHD resolution. All my videos are in FullHD or even less. In our country all TV show are in that resolution. SnapDragon speed is amazing but FullHD or 720p are not so good on 3K displays. I found that some 4K videos look better on just FullHD. Same is on Apple systems. I thought i ll switch (after 30 y of Win) but new Surface works and feels so damn good. I know they never be in just FullHD, so maybe some day SnapDragon will be. Its ok, I have 2y old Yoga and it is fine, just the fan noise is killing me. Maybe I was to long but I think that fan noise and resolution are important factors. My old concert videos look kind a shitty on 3K or even 2K.",
                "likes": 0
            },
            {
                "author_name": "@nancyjones6235",
                "comment": "I'm rocking a Dell Inspiron 7586, Core i7 processor and 4k screen. I spent about $2k USD. It's a workhorse for me, I do photo processing along with my writing. While I'd love to go to a tablet for my day-to-day, my photo processing isn't just for Instagram, I sell large-format photography prints so I need to be able to upscale some of the images, and those programs need a lot of hoss. I got a Chromebook during Prime Days one year but had to give it up to my husband when his iPad and notebook died within a week of each other. I'll probably be replacing my laptop for Christmas this year, and it'll probably be another high-end Dell. Great video, thanks for the work you put into these.",
                "likes": 1
            },
            {
                "author_name": "@jacobphiri",
                "comment": "dongles are not fun to buy you know. the make the workspace ugly",
                "likes": 1
            },
            {
                "author_name": "@dietmarschmitz5792",
                "comment": "Great video, but you missed Linux. And reapairable Laptops like the Framework.",
                "likes": 4
            },
            {
                "author_name": "@akilakbaraly9095",
                "comment": "Asus proart studio book, you can tick all your requests, and as if it's not cheaper, it remains a good deal\n\nYou should try one!",
                "likes": 0
            },
            {
                "author_name": "@dahumbleprof",
                "comment": "My current laptop is a Dell Inspiron 16 Plus (the 7610 SKU) with a Core i7-11800H and 32GB RAM (upgraded) 😌\nI'm a huge Samsung fan, so my next laptop is probably going to be the Galaxy Book4 Edge 🥳",
                "likes": 0
            },
            {
                "author_name": "@lukerichards8094",
                "comment": "How many bloody laptops do you have in your house 😂",
                "likes": 0
            },
            {
                "author_name": "@johnpaulcando8973",
                "comment": "Watching this is my Macbook Air M2. MacOS is the perfect operating system for my job. 😍",
                "likes": 1
            },
            {
                "author_name": "@akin242002",
                "comment": "Never go with Chromebooks.  Too many issues.\n\nEither Windows or MacBooks.\n- Windows for gaming, work software compatibility, adjustable SSD, and ports for all kinds of accessories (wireless mouse, wireless keyboards, and external monitors).  \n- MacBooks for creator professional jobs, front-end website work, DJs, and general web browsing with a high-quality built laptop.",
                "likes": 11
            },
            {
                "author_name": "@chairman67",
                "comment": "I want a new laptop with a 17\" screen in 16.10,  that is compatible with Linux, with 32GB RAM & 2x NVMe slots. To be used for productivity, no gaming. What suitable laptops are available?",
                "likes": 0
            },
            {
                "author_name": "@JOHNLEXXX",
                "comment": "Tip 13: what phone are you using?  iPhone works great with Mac, and Android phones go well with Window and Chrome system. I have a Samsung phone and I hate that I can not connect it to any of my Apple devices.",
                "likes": 0
            },
            {
                "author_name": "@IqraaFamilyProduction",
                "comment": "You Don't do Giveaways?",
                "likes": 0
            },
            {
                "author_name": "@mattcarter-bennett",
                "comment": "Thanks very much for this video, it answers loads of questions that were in my head.  I’m a photographer using full frame cameras that produce images up to 60MP and medium format cameras with images up to 100MP; Apple aside, I’m looking for ideally a Windows laptop that has the most true to life image rendition for image editing and one that can cope with large files while multi tasking.  Oh and I edit a lot of 4k video too.  I saw your video on the ASUS Pro Art P16 and it looks like it’s well fit for purpose.  I’d really appreciate your opinion on this laptop and if there are others that are equally as fit for purpose, especially for the image quality and resolution.  Thanks again for this video and for your channel.  Your reviews are a breath of fresh air and incredibly easy to follow while being super informative (I’ve subscribed). Cheers, Matt.",
                "likes": 0
            },
            {
                "author_name": "@edgargabriel6640",
                "comment": "WHAT WE SAY HERE IS \"last years' best developer' machine is this years' best user machine\"\nGreetings from Germany",
                "likes": 0
            },
            {
                "author_name": "@garyoneil9791",
                "comment": "Erm... at 1.55 why does your Storm Trooper have a willy?",
                "likes": 0
            },
            {
                "author_name": "@kieranj67",
                "comment": "Great video, fast & super informative, thank you",
                "likes": 5
            },
            {
                "author_name": "@hjr2000",
                "comment": "Apple? Spit. Those guys collude with Police states to suppress human rights!",
                "likes": 0
            },
            {
                "author_name": "@WillyLau",
                "comment": "Can't wait to watch the recommendation video. I am looking for a 4K video editing laptop to buy this year.",
                "likes": 19
            },
            {
                "author_name": "@JohnnyJamesGio",
                "comment": "Hi Tom! Is it just me or have you changed the mic setup in some way? Seems to me you sound different",
                "likes": 0
            },
            {
                "author_name": "@mudianyikevin7470",
                "comment": "Hi, which one would you recommend between the HP spectre 14 2-in-1 and the Asus Zenbook 14 pro Duo? I can't decide",
                "likes": 1
            },
            {
                "author_name": "@jamesklusener",
                "comment": "I recently bought a laptop after sharing one with my mom, was lucky enough to get the MSI Modern 14 with a 12th gen core i5 on special and it's been great, this buying guide was very helpful and quite accurate, never been a better time to be in the market for a new laptop!",
                "likes": 7
            },
            {
                "author_name": "@modbusd119",
                "comment": "What do you think of asus build quality and  \n how reliable it is because I think it doesn't worth paying over 1000 dollar for a Taiwanese laptop",
                "likes": 1
            },
            {
                "author_name": "@jonkingston",
                "comment": "He says the downside of Chromebooks are that they \"need\" to be connected to the internet. First of all, no they don't. You can do a lot of work offline with Google Docs.   Second, don't you \"need\" to connect Windows and MacOS to the internet also? How useful is any laptop without an internet connection? Please do not talk about Chrome OS if you don't know anything byabout it.",
                "likes": 0
            },
            {
                "author_name": "@Ipinoluwa",
                "comment": "❤",
                "likes": 0
            },
            {
                "author_name": "@RichWithTech",
                "comment": "Tip 1: Don't buy ASUS until we know they've addressed the RMA scandal",
                "likes": 10
            },
            {
                "author_name": "@henrysam333",
                "comment": "We need a video about “Workstation buying guide” 🔥",
                "likes": 3
            },
            {
                "author_name": "@henrysam333",
                "comment": "We need a video about “All-In-One buying guide” 🔥",
                "likes": 20
            },
            {
                "author_name": "@henrysam333",
                "comment": "We need a video about “desktop buying guide” 🔥",
                "likes": 3
            },
            {
                "author_name": "@realdickwood",
                "comment": "The Lenovo Yogabook 9i has been a fantastic experience. I also bought a LG Gram 14 Style, but it sits and collects dust.",
                "likes": 0
            },
            {
                "author_name": "@kartikkkkk",
                "comment": "I have a suggestion, when stating pricing of the laptops, state there pricing in other currencies as well, like Indian Rupee, it will help non uk based audiences cause it ruins the experience by constantly checking prices in other currencies.",
                "likes": 1
            },
            {
                "author_name": "@FJano12",
                "comment": "Surface go still the best pc for travel.",
                "likes": 3
            },
            {
                "author_name": "@huyvole9724",
                "comment": "The British language sounds wonderful",
                "likes": 0
            },
            {
                "author_name": "@leakyabstraction",
                "comment": "I don't agree with what was said about the Macbook Air being the best general choice. I just looked into getting one, and it's such an obscene, obsolete product I think. The base price is high to begin with, and the default configuration of 8GB RAM and 256GB storage is nothing else than a complete insult, with upgrade prices being a downright robbery. So, for 1600-1800 dollars/euros you end up with a product that has 16GB RAM, only 512GB storage, with a soldered SSD that can brick your device easily, combined with a 60 Hz LCD display. That's a lot of compromises for a somewhat longer battery life. Meanwhile competing laptops offer similar build quality, 16GB RAM in the base config, 120Hz OLED screen, replaceable/uprgradeable SSD, perhaps even 2-in-1 functionality, at a significantly lower price.",
                "likes": 27
            },
            {
                "author_name": "@flipevent",
                "comment": "Answering the question on the onset: I'm using the laptop that you used for your thumbnail. :) The Zenbook Duo (2024) with the Core Ultra 9. \n\nI'm about above average content with it. It has its flaws for sure, and is far from being a perfect laptop. BUT, for my purposes and life as of right this second, having two screens on the go is simply an undeniable form-factor win that I couldn't say no to it.",
                "likes": 2
            },
            {
                "author_name": "@anuj18",
                "comment": "Thanks a lot! Wonderful guide as usual. I remember that these lines have been spoken verbatim before on previous buying guide: 01:35-01:45 🙂",
                "likes": 3
            },
            {
                "author_name": "@ThanArlix",
                "comment": "\"You can't argue, that a macbook air is arguably the best all round laptop that you can buy\". \n\nIts arguable but you're not allowed. 😂",
                "likes": 8
            },
            {
                "author_name": "@vip10277",
                "comment": "what's the best laptop for watching anime?",
                "likes": 0
            },
            {
                "author_name": "@bryans8656",
                "comment": "I agree about the MacBook Air but I'm happy to see Windows getting competitive.\nI've been enjoying your posts so I finally subscribed.",
                "likes": 1
            },
            {
                "author_name": "@AirrowRocket",
                "comment": "The best, most honest and practical advice for the consumer-at-large I've watched in a long, long time.  Keep up the great work.",
                "likes": 14
            },
            {
                "author_name": "@downingbots",
                "comment": "instructions unclear, can i argue about this or not? 1:47 \"You can't argue that a Macbook Air is, arguably, the best laptop all-round laptop you can buy\"\n\nit's nothing in the grand scheme of things, just haven't seen someone do a \"definitely maybe\" in this way before & I thought it was fun",
                "likes": 0
            },
            {
                "author_name": "@modoulaminceesay9211",
                "comment": "New level unlocked , the videos are becoming better",
                "likes": 2
            },
            {
                "author_name": "@omsingh4478",
                "comment": "The fact that they are both double price than x100 pro is insane",
                "likes": 0
            },
            {
                "author_name": "@Dr.D00p",
                "comment": "My tip, Dont buy an expensive gaming laptop (4080/90) right now. The new 5080/90 equipped gaming laptops will be revealed at CES 2025 in January.  Spending £2K to £3K (or more) just 6mths away from new GPU laptops will give you serious buyers' remorse. Especially if you keep your laptops for 2 or 3yrs before upgrading. Obviously, if you're a rich git and change laptops every year, feel free to ignore my tip 😊",
                "likes": 85
            },
            {
                "author_name": "@daledevernon56",
                "comment": "The majority of people when deciding what laptop to buy it's got nothing to do with the hardware it's got to do whether it's Windows or Mac OS.",
                "likes": 1
            },
            {
                "author_name": "@IMvictory837",
                "comment": "I’m a student looking for a good portable laptop that won’t break the bank, but is good for all my schoolwork, entertainment, and maybe a little bit of gaming, any recommendations?",
                "likes": 0
            },
            {
                "author_name": "@ryansingh7353",
                "comment": "Was waiting for this Video!",
                "likes": 5
            },
            {
                "author_name": "@lfc1981",
                "comment": "using Acer Swift Go 16! other than a mid range intel arc gpu not for heavy gamers, all others are top range! ultra 7, wifi 7, 2 TB4, 1 hdmi 2.1, intel evo, 32gb ram. 1 TB storage. will last for years for everyday use, or even for creators.",
                "likes": 0
            }
        ]
    }
]